#include "hooks.h"
#include "archive_reader.h"
#include "utils.h"
#include <sstream>
#include <iomanip>
#include <iostream>
#include <cstdint>
#include <unordered_map>
#include <fstream>
#include <iostream>
#include <filesystem>
#include <string>
#include <unordered_set>

int GetTotalPakFileName() {
	return *(int*)GetAddressFromRva(0x4f6d020);
}
const char** GetPakFileNameArray() {
	return *(const char***)GetAddressFromRva(0x4f6d028);
}
void LogPakFileNames() {
	auto fileNameArray = GetPakFileNameArray();
	auto count = GetTotalPakFileName();

	for (int i = 0; i < count; i++) {
		log("pak file[%d] %s", i, fileNameArray[i]);
	}
}

unsigned __int64 HK_My_ResourceReadBuffer(
	ResourceReaderHandle* reader, unsigned char* buffer,
	unsigned __int64 readOffset, unsigned __int64 readLength)
{
	log("============================");
	log("[Hook Begin] ResourceReadBuffer");
	log("reader ptr: %p, buffer ptr: %p, readOffset: %llx, readLength: 0x%llx",
		reader, buffer, readOffset, readLength);
	//auto bufferAddr = (UINT64)buffer;
	//log("buffer ptr addr bytes: %s", GetHexString(&bufferAddr, 8));
	MyString* fullPathString = (MyString*)reader->fullPath;
	log("fullPath: %s", fullPathString->str);
	// Call the original function
	//log("read offset: %llu", readOffset);
	//log("read len   : %d", readLength);
	auto result = backup_ResourceReadBuffer(reader, buffer, readOffset, readLength);
	//log("[Postfix]");

	// first called on read header
	//if (readOffset == 0 && readLength == 0x28) {

	ArchiveFileEntry* p4_fileEntry, char* param_5, LONGLONG p6_blockOffset, ULONGLONG p7_blockLength,
	uint32_t param_8);
My_DecompressCoreFile_t backup_My_DecompressCoreFile;
// p7_readLength prefetch: == full size,
// and other core file use <= 0x40000 | <= 256kb
MyReadFileStatus My_DecompressCoreFile
(ResourceManager* p1_resManager, MyString* p2_coreVirtualPath, MyPakFileInfo* p3_pakFileInfo,
	ArchiveFileEntry* p4_fileEntry, char* p5_outBuffer, LONGLONG p6_readOffset, ULONGLONG p7_readLength,
	uint32_t param_8)
{
	log("Begin My_DecompressCoreFile: %s", p2_coreVirtualPath->str);
	auto pakFile = p3_pakFileInfo;
	log("pakFile: %p", pakFile);
	//log("pakFile file path: %s", pakFile->filePath);
	//log("fileEntry hash %llx", p4_fileEntry->hash);
	//log("fileEntry entryNum: %llu", p4_fileEntry->entryNum);
	log("fileEntry size: %llu", p4_fileEntry->size);
	log("fileEntry offset: %llu", p4_fileEntry->offset);
	log("p6_readOffset: %lld", p6_readOffset);
	log("p7_readLength: %llu", p7_readLength);

	//log("calling..");
	auto status = backup_My_DecompressCoreFile(
		p1_resManager, p2_coreVirtualPath, p3_pakFileInfo, p4_fileEntry, p5_outBuffer, p6_readOffset, p7_readLength, param_8);
	log("called, retValue: %u", status);

	//// debug dump file
	//std::string fileName = ConvertFileHashToName(p4_fileEntry->hash);
	//if (fileName.find("prefetch") != std::string::npos)
	//{
	//	std::string savePath = fileName.c_str() + 6;
	//	ReplaceSlashWithDoubleUnderscore(savePath);
	//	savePath = "dump/" + savePath;
	//	if (std::filesystem::exists(savePath) == false) {
	//		std::fstream fs(savePath.c_str(), std::ios::binary | std::ios::trunc);
	//		fs.close();
	//	}

	//	std::fstream fs(savePath.c_str(), std::ios::in | std::ios::out | std::ios::binary);
	//	log("try save file at: %s", savePath.c_str());
	//	if (fs.is_open()) {
	//		fs.seekp(p6_readOffset);
	//		fs.write(p5_outBuffer, p7_readLength);
	//		fs.close();
	//		log("updated bytes offset: %llu, length: %llu, buffer: %p", p6_readOffset, p7_readLength, p5_outBuffer);
	//		if (p7_readLength == p4_fileEntry->size) {
	//			log("successfully dump file %s!", fileName.c_str());
	//		}
	//	}
	//	else {
	//		log("failed can't open file: %s", savePath.c_str());
	//	}
	//}

	log("End My_DecompressCoreFile");
	return status;
}

typedef bool(*My_LoadCoreBinaryFile_t)(MyString* p1_coreFilePath,
	MyString* param_2, void* param_3, void* param_4);
My_LoadCoreBinaryFile_t backup_My_LoadCoreFile;
bool My_LoadCoreFile
(MyString* p1_coreFilePath, MyString* p2_outLoadedCoreFileName, void* param_3,
	void* param_4)
{
	log("Begin My_LoadCoreFile, coreFilePath: %s", p1_coreFilePath->str);
	log("  p2: %s", p2_outLoadedCoreFileName->str);
	log("  p3: %p", param_3);
	log("  p4: %p", param_4);
	log("calling backup_My_LoadCoreFile");
	auto loadOK = backup_My_LoadCoreFile(p1_coreFilePath, p2_outLoadedCoreFileName, param_3, param_4);
	log("Postfix: My_LoadCoreFile: result: %d", loadOK);
	log("  p2: %s", p2_outLoadedCoreFileName->str);
	log("End My_LoadCoreFile");
	return loadOK;
}

struct MyTaskDecompressCore {
	byte decompressType;// 0x0
	byte gap_0x1[0x3]; // 0x1
	uint32_t progressStatus; // 0x4
	uint32_t var_0x8; // 0x8
	uint64_t var_0x10; // 0x10
	char var_0x18[0x10]; // 0x18
	void* var_0x28; // 0x28
	char* coreFileName; // 0x30 -> 0x37
	uint32_t var_0x38; // 0x38
	int status; // 0x3c
	uint64_t currentTotalBufferSize;
	uint64_t remainingBufferSize;
	void* buffer; // 0x50
};


// crash some time
void LogMyTaskDecompressCore(MyTaskDecompressCore* job) {
	log("MyTaskDecompressCore info...");
	log("  coreFileName2: %s", job->coreFileName);
	log("  decompressType: %u", job->decompressType);
	log("  progressStatus: %u", job->progressStatus);
	log("  var 0x28: %llu", (uint64_t)job->var_0x28);
	log("  var0x38: %u", job->var_0x38);
	log("  status: %u", job->status);
	log("  totalBufferSize: %llu", job->currentTotalBufferSize);
	log("  remaining: %llu", job->remainingBufferSize);
	log("  buffer: %p", job->buffer);
}

typedef void (*My_AboutDecompressCoreFile_t)(uintptr_t param_1, void* param_2);
My_AboutDecompressCoreFile_t backup_My_AboutDecompressCoreFile;
void My_AboutDecompressCoreFile(uintptr_t param_1, MyTaskDecompressCore* p2_task) {
	log("Begin My_AboutDecompressCoreFile, param_1: %llx", param_1);
	auto task = p2_task;

	backup_My_AboutDecompressCoreFile(param_1, p2_task);

	log("postfix My_AboutDecompressCoreFile");
	log("  task status %d", task->status);

	log("End My_AboutDecompressCoreFile");
}

struct My_RMDecompress7_Job {
	char* fileName; // 0x00
	uint64_t unk_0x8; //0x08
	ResourceManager* resManager; // 0x10
	char gap_0x18[0x10]; // 0x18 -> 0x27
	MyPakFileInfo* pakFile; // 0x28 -> 0x2F
	ArchiveFileEntry* fileEntry; // 0x30 -> 0x37
};
typedef MyReadFileStatus(*My_RM_VT7_DecompressCoreFile3_t) (ResourceManager* resManager,
	My_RMDecompress7_Job* p2_job, void* p3_outBuffer,
	size_t p4_blockOffset, size_t p5_blockLength, uint32_t param_6);
My_RM_VT7_DecompressCoreFile3_t backup_My_RM_VT7_DecompressCoreFile3;
MyReadFileStatus My_RMDecompressCore7(ResourceManager* resManager,
	My_RMDecompress7_Job* p2_job, void* p3_outBuffer,
	size_t p4_blockOffset, size_t p5_blockLength, uint32_t param_6)
{
	log("Begin My_RMDecompressCore7, resManager: %p, p2_job: %p, p3_outBuffer: %p",
		resManager, p2_job, p3_outBuffer);
	log("  p4_blockOffset: %zu, p5_blockLength: %zu, param_6: %u",
		p4_blockOffset, p5_blockLength, param_6);
	log("  job: %p", p2_job);
	log("  job fileName: %s", p2_job->fileName);

	log("  job resManager: %p", p2_job->resManager);
	MyReadFileStatus status = backup_My_RM_VT7_DecompressCoreFile3(resManager, p2_job, p3_outBuffer,
		p4_blockOffset, p5_blockLength, param_6);
	log("  result: %d", status);

	log("End My_RMDecompressCore7");

	return status;
}

typedef MyString* (*My_GetCoreFilePathForReader_t)(MyString* p1_coreFileName, MyString* p2_outCoreFilePath);
My_GetCoreFilePathForReader_t backup_My_GetCoreFilePathForReader;

// Mod register
namespace fs = std::filesystem;
class ModEntry {
public:
	std::string modFolderName;
	std::string modFolderPath;
	std::unordered_set<std::string> fileFullPaths;
	std::unordered_set<std::string> gameCoreFileNames;
	std::unordered_map<std::string, std::string> coreFilePathLookupByName;
};
// key: core file path
std::unordered_map<std::string, ModEntry*> g_modEntryLookupWithCoreFilePath;
std::vector<ModEntry*> g_mods;

bool TryGetCoreFileReplace(const char* coreFileNameNoExt, ModEntry** p2_inoutMod,
	const char** p3_inoutNewCoreFilePath, bool isCoreStreamFileExt) {
	std::string newFilePathExt = coreFileNameNoExt;
	newFilePathExt.append(isCoreStreamFileExt ? ".core.stream" : ".core");
	if (g_modEntryLookupWithCoreFilePath.find(newFilePathExt) == g_modEntryLookupWithCoreFilePath.end())
		return false;

	auto mod = g_modEntryLookupWithCoreFilePath[newFilePathExt];
	*p2_inoutMod = mod;

	std::string redirectCoreFilePath = "source:" + mod->modFolderPath + '/' + newFilePathExt;
	std::replace(redirectCoreFilePath.begin(), redirectCoreFilePath.end(), '\\', '/');
	*p3_inoutNewCoreFilePath = redirectCoreFilePath.c_str();

	return true;
}

MyString* My_GetCoreFilePathForReader(MyString* p1_coreFileName, MyString* p2_outCoreFilePath) {
	auto coreFileNameNoExt = p1_coreFileName->str;
	//log("Begin My_GetCoreFilePathForReader, p1_coreFileNameNoExt: %s", coreFileNameNoExt);
	auto retValue = backup_My_GetCoreFilePathForReader(p1_coreFileName, p2_outCoreFilePath);
	ModEntry* mod = nullptr;
	const char* newCoreFilePath;
	if (TryGetCoreFileReplace(coreFileNameNoExt, &mod, &newCoreFilePath, false)) {
		SetNewMyString(p2_outCoreFilePath, newCoreFilePath);
		log("redirect new .core file: %s, mod: %s", p2_outCoreFilePath->str, mod->modFolderName.c_str());
	}

	//log("Post call: My_GetCoreFilePathForReader: result: %s", retValue->str);
	//log("End My_GetCoreFilePathForReader");
	return retValue;
}


My_GetCoreFilePathForReader_t backup_My_GetCoreStreamFilePathForReader;
MyString* My_GetCoreStreamFilePathForReader(MyString* p1_coreStreamFileName, MyString* p2_outCoreStreamFilePath) {
	//log("Begin My_GetCoreStreamFilePathForReader, p1_coreStreamFileName: %s", p1_coreStreamFileName->str);
	auto retValue = backup_My_GetCoreStreamFilePathForReader(p1_coreStreamFileName, p2_outCoreStreamFilePath);
	ModEntry* mod = nullptr;
	const char* newCoreFilePath;
	if (TryGetCoreFileReplace(p1_coreStreamFileName->str, &mod, &newCoreFilePath, true)) {
		SetNewMyString(p2_outCoreStreamFilePath, newCoreFilePath);
		log("redirect new .core.stream file: %s, mod: %s", p2_outCoreStreamFilePath->str, mod->modFolderName.c_str());
	}
	//log("End My_GetCoreStreamFilePathForReader");
	return retValue;
}



typedef void (*My_GetFileCountInPath_t)(MyString* param_1, int* param_2, int* param_3);
My_GetFileCountInPath_t backup_My_GetFileCountInPath;
void My_GetFileCountInPath(MyString* param_1, int* param_2, int* param_3)
{
	log("Begin My_GetFileCountInPath, param_1: %s, param_2: %p, param_3: %p",
		param_1->str, param_2, param_3);
	log("  param_2: %d", *param_2);

	backup_My_GetFileCountInPath(param_1, param_2, param_3);
	log("Post call");
	log("   param2: %d", *param_2);
	log("End My_GetFileCountInPath");
}

typedef bool (*My_StringCheck_t)(MyString* param_1, MyString* param_2);
My_StringCheck_t backup_My_StringCheck;
bool My_StringIsSame2(MyString* param_1, MyString* param_2) {
	log("Begin My_StringIsSame2, param_1: %s, param_2: %s", param_1->str, param_2->str);
	bool result = backup_My_StringCheck(param_1, param_2);
	log("Post call: result: %d", result);
	log("End My_StringIsSame2");
	return result;
}
typedef bool (*My_StringIsSame3_t)(MyString* param_1, MyString* param_2, int len);
My_StringIsSame3_t backup_My_StringIsSame3;
bool My_StringIsSame3(MyString* param_1, MyString* param_2, int len) {
	log("Begin My_StringIsSame3, param_1: %s, param_2: %s, len: %d",
		param_1->str, param_2->str, len);
	bool result = backup_My_StringIsSame3(param_1, param_2, len);
	log("Post call: result: %d", result);
	log("End My_StringIsSame3");
	return result;
}

struct SomeEntry {
	char* var_0x0;
	char* var_0x8;
	char* hash; // 0x10
	uint64_t var_0x28;
	char* toAssetPath; // 0x30
	char* fromAssetPath; // 0x38
};
typedef void (*My_AboutResolveLinkAsset_t)(void* param_1, void* param_2, void* param_3, char* param_4);
My_AboutResolveLinkAsset_t backup_My_AboutResolveLinkAsset;
void My_AboutResolveLinkAsset(void* param_1, void* param_2, void* param_3, char* param_4) {
	log("Begin My_AboutResolveLinkAsset, param_1: %p, param_2: %p, param_3: %p, param_4: %p",
		param_1, param_2, param_3, param_4);
	auto p3_vector = (MyVector*)param_3;
	log("p3 vector count: %d", p3_vector->count);
	log("p3 vector capacity: %d", p3_vector->capacity);
	backup_My_AboutResolveLinkAsset(param_1, param_2, param_3, param_4);
	log("End My_AboutResolveLinkAsset");
}

typedef uintptr_t(*My_FindTargetObject_t)(void* param_1, void* param_2, void* param_3);
My_FindTargetObject_t backup_My_FindTargetObject;
uintptr_t My_FindTargetObject(void* param_1, void* p2_guid, void* param_3) {
	log("Begin My_FindTargetObject, param_1: %p, param_2: %p, param_3: %p",
		param_1, p2_guid, param_3);
